{
  "main": {
    "subtitle": "Hi! I'm ",
    "name": "Rustem",
    "description": "Here you can get acquainted with my portfolio, view my projects, learn about me and my technology stack.",
    "btnShow": "View stack",
    "btnHide": "Hide stack"
  },
  "about": {
    "aboutDescription": "Hello! My name is Rustem, I am a frontend developer. Over the three years of my web development career, I have successfully implemented many projects, starting with creating complex user interfaces from scratch, as well as supporting and refining existing ones. Efficient use of various libraries to ensure scalability and application state management.",
    "aboutUi": "Component Creation: Developed a UI kit with high-level components and their integration to achieve maximum performance and ease of use.",
    "aboutSeo": "SEO: Knowledge and experience in SEO implementation, including the correct use of meta tags, optimization of headlines and other factors to increase the visibility of projects in search engines.",
    "aboutOptimization": "Optimization and performance: actively sought to create not only beautiful, but also high-performance user interfaces. Working with caching, memoization, lazy loading.",
    "aboutDesign": "Adaptive design: Working with various devices and browsers, creating adaptive interfaces that ensure the same high quality of visualization on all devices.",
    "aboutApi": "Working with the API: Integration with various external APIs to receive and update data. Ensuring effective interaction with the server",
    "hardSkills": {
      "stack": {
        "skills1": "React, Next.js, Gatsby, JavaScript, TypeScript",
        "skills2": "HTML, CSS, SCSS",
        "skills3": "Axios, GraphQL, REST API",
        "skills4": "React Hook Form, Formik, Yup, Zod",
        "skills5": "Adaptive Layout, Cross-Browser Layout, Mobile first",
        "skills6": "Redux Toolkit, Material-UI, Radix UI, Framer Motion",
        "skills7": "Tanstack Query, i18next,  clsx, Recharts, dayjs, react-router-dom, etc."
      },
      "clean": "To ensure the purity and standard of the code, the projects use tools: ESLint / Prettier",
      "config": "Set up the configuration for Storybook и Webpack.",
      "git": "Working with Git / GitHub / GitLab",
      "management": "Managing and working with tasks in YouTrack and Trello",
      "figma": "Experience working with figma as a web designer"
    },
    "softSkills": "Organization and planning of working hours, analytical thinking, the desire to learn and develop, communication skills, ability to work in a team, stress tolerance"
  },
  "notFound": {
    "descr": "The page was not found, but there are more interesting pages"
  },
  "navbar": {
    "home": "_home",
    "about": "_about me",
    "projects": "_projects"
  },
  "buttons": {
    "cardBtn": "View project",
    "backBtn": "Back"
  },
  "roadmap": {
    "years": {
      "years1": "%d year",
      "years2": "%d years",
      "years3": "%d years"
    },
    "months": {
      "months1": "%d month",
      "months2": "%d months",
      "months3": "%d months"
    },
    "weeks": {
      "weeks1": "%d week",
      "weeks2": "%d weeks",
      "weeks3": "%d weeks"
    },
    "days": {
      "days1": "%d day",
      "days2": "%d days",
      "days3": "%d days"
    }
  },
  "experience": {
    "responsibilities": "Job responsibilities:",
    "stack": "Technologies used:",
    "bank": {
      "title": "Software engineer at the Sovcombank",
      "subtitle": "Teamwork in the development and improvement of the bank's products",
      "etc": "Engaged in creating user interfaces and much more",
      "date": "From April 2023 to the present",
      "dutiesList": { "dutie1": "NDA" }
    },
    "marketplace": {
      "title": "Marketplace",
      "subtitle": "Project, team work on the development of the marketplace",
      "etc": "React, mobx, typescript, scss, antd and other third-party libraries",
      "date": "From December 2022 to April 2023",
      "dutiesList": {
        "dutie1": "Administrative panel , payment connection, payment by crypt",
        "dutie2": "Writing application logic",
        "dutie3": "Refactoring the code to improve its optimization and maintainability",
        "dutie4": "Layout of an adaptive and cross-browser site according to the layout"
      }
    },
    "startup": {
      "title": "Startup",
      "subtitle": "Project, team work on the project of the site, which provides the possibility of online registration for a wide range of services",
      "etc": "React, effector, typescript, scss , antd, jwt, git and other third-party libraries",
      "date": "From August 2022 to December 2022",
      "dutiesList": {
        "dutie1": "Creating a design for a project",
        "dutie2": "Writing application logic",
        "dutie3": "Refactoring the code to improve its optimization and maintainability",
        "dutie4": "Layout of an adaptive and cross-browser site according to the layout",
        "dutie5": "Working with a large number of API"
      }
    },
    "moneyForLeads": {
      "title": "MoneyForLeads",
      "subtitle": "Моя первая работа, где я был изначально в роли верстальщика, потом полностью перешел на позицию frontend разработчика, выполнял различные проекты",
      "etc": "HTML5, SCSS, JS, i18next, React, Redux-toolkit, git, gitLab, youTrack and other third-party libraries",
      "date": "From May 2021 to August 2022",
      "dutiesList": {
        "dutie1": "Participation in planning and holding meetings with the development team",
        "dutie2": "Refactoring the code to improve its optimization and maintainability",
        "dutie3": "Layout of an adaptive and cross-browser site according to the layout",
        "dutie4": "Collaboration with designers, backends, product managers"
      }
    }
  }
}
